[
  {
    "id": "N1",
    "title": "HDFC Bank announces 15% dividend, board approves stock buyback",
    "body": "HDFC Bank announces 15% dividend, board approves stock buyback. Further details were not immediately available.",
    "source": "Business Standard",
    "published_at": "2025-11-05T09:00:00"
  },
  {
    "id": "N2",
    "title": "RBI raises repo rate by 25bps to 6.75%, citing inflation concerns",
    "body": "RBI raises repo rate by 25bps to 6.75%, citing inflation concerns. Further details were not immediately available.",
    "source": "Economic Times",
    "published_at": "2025-11-07T09:00:00"
  },
  {
    "id": "N3",
    "title": "ICICI Bank opens 500 new branches across Tier-2 cities",
    "body": "ICICI Bank opens 500 new branches across Tier-2 cities. Further details were not immediately available.",
    "source": "MoneyControl",
    "published_at": "2025-11-10T09:00:00"
  },
  {
    "id": "N4",
    "title": "Banking sector NPAs decline to 5-year low, credit growth at 16%",
    "body": "Banking sector NPAs decline to a 5-year low while credit growth accelerates to 16%. Further details were not immediately available.",
    "source": "LiveMint",
    "published_at": "2025-11-03T09:00:00"
  },
  {
    "id": "N5",
    "title": "Axis Bank reports 20% jump in Q2 net profit on strong loan growth",
    "body": "Axis Bank reports a 20% jump in Q2 net profit driven by strong loan growth. Further details were not immediately available.",
    "source": "Business Standard",
    "published_at": "2025-11-02T09:00:00"
  },
  {
    "id": "N6",
    "title": "RBI keeps repo rate unchanged, signals data-dependent stance",
    "body": "The Reserve Bank of India keeps the repo rate unchanged and signals a data-dependent stance in upcoming meetings. Further details were not immediately available.",
    "source": "Economic Times",
    "published_at": "2025-11-08T09:00:00"
  },
  {
    "id": "N7",
    "title": "ITC shares gain after company announces FMCG business expansion",
    "body": "ITC shares gain in trade after the company announces a major expansion in its FMCG business. Further details were not immediately available.",
    "source": "MoneyControl",
    "published_at": "2025-11-04T09:00:00"
  },
  {
    "id": "N8",
    "title": "TCS signs multi-year digital transformation deal with European bank",
    "body": "TCS signs a multi-year digital transformation deal with a large European bank. Further details were not immediately available.",
    "source": "LiveMint",
    "published_at": "2025-11-06T09:00:00"
  },
  {
    "id": "N9",
    "title": "Infosys stock slips as company cuts revenue guidance",
    "body": "Infosys stock slips in early trade after the company cuts its full-year revenue guidance. Further details were not immediately available.",
    "source": "Business Standard",
    "published_at": "2025-11-01T09:00:00"
  },
  {
    "id": "N10",
    "title": "SEBI tightens disclosure norms for listed companies",
    "body": "SEBI tightens disclosure norms for listed companies to improve transparency for investors. Further details were not immediately available.",
    "source": "Economic Times",
    "published_at": "2025-11-09T09:00:00"
  },
  {
    "id": "N11",
    "title": "RBI announces new liquidity measures for NBFCs",
    "body": "The Reserve Bank of India announces new liquidity measures to support NBFCs amid market volatility. Further details were not immediately available.",
    "source": "LiveMint",
    "published_at": "2025-11-03T09:30:00"
  },
  {
    "id": "N12",
    "title": "Auto sector demand picks up ahead of festive season",
    "body": "Auto sector demand picks up ahead of the festive season with dealers reporting higher bookings. Further details were not immediately available.",
    "source": "MoneyControl",
    "published_at": "2025-11-02T10:00:00"
  },
  {
    "id": "N13",
    "title": "Maruti Suzuki reports record monthly sales, exports surge",
    "body": "Maruti Suzuki reports record monthly sales with a sharp surge in exports. Further details were not immediately available.",
    "source": "Business Standard",
    "published_at": "2025-11-05T11:00:00"
  },
  {
    "id": "N14",
    "title": "Tata Motors shares rally on strong EV sales growth",
    "body": "Tata Motors shares rally as the company reports strong growth in its electric vehicle sales. Further details were not immediately available.",
    "source": "Economic Times",
    "published_at": "2025-11-06T11:30:00"
  },
  {
    "id": "N15",
    "title": "Steel sector under pressure as global prices soften",
    "body": "The steel sector comes under pressure as global steel prices soften amid weak demand. Further details were not immediately available.",
    "source": "LiveMint",
    "published_at": "2025-11-07T12:00:00"
  },
  {
    "id": "N16",
    "title": "JSW Steel announces capacity expansion plan in Odisha",
    "body": "JSW Steel announces a major capacity expansion plan in Odisha to meet long-term demand. Further details were not immediately available.",
    "source": "MoneyControl",
    "published_at": "2025-11-08T12:30:00"
  },
  {
    "id": "N17",
    "title": "Adani Ports traffic grows 18% YoY across major terminals",
    "body": "Adani Ports reports an 18% year-on-year growth in cargo traffic across its major terminals. Further details were not immediately available.",
    "source": "Business Standard",
    "published_at": "2025-11-01T13:00:00"
  },
  {
    "id": "N18",
    "title": "Power sector gains as government clears overdue DISCOM payments",
    "body": "Power sector stocks gain as the government clears overdue DISCOM payments to generation companies. Further details were not immediately available.",
    "source": "Economic Times",
    "published_at": "2025-11-02T13:30:00"
  },
  {
    "id": "N19",
    "title": "Rupee weakens to record low against US dollar",
    "body": "The Indian rupee weakens to a record low against the US dollar amid global risk aversion. Further details were not immediately available.",
    "source": "LiveMint",
    "published_at": "2025-11-03T14:00:00"
  },
  {
    "id": "N20",
    "title": "Crude oil prices rise amid Middle East tensions",
    "body": "Crude oil prices rise as geopolitical tensions escalate in the Middle East. Further details were not immediately available.",
    "source": "MoneyControl",
    "published_at": "2025-11-04T14:30:00"
  },
  {
    "id": "N21",
    "title": "Housing finance stocks gain on lower home loan rates",
    "body": "Housing finance company stocks gain as lenders cut home loan rates to attract borrowers. Further details were not immediately available.",
    "source": "Business Standard",
    "published_at": "2025-11-05T15:00:00"
  },
  {
    "id": "N22",
    "title": "RBI issues draft norms for digital lending apps",
    "body": "The Reserve Bank of India issues draft norms for digital lending apps to curb malpractices. Further details were not immediately available.",
    "source": "Economic Times",
    "published_at": "2025-11-06T15:30:00"
  },
  {
    "id": "N23",
    "title": "Fintech startups welcome regulatory sandbox expansion",
    "body": "Fintech startups welcome the expansion of the regulatory sandbox framework for innovation. Further details were not immediately available.",
    "source": "LiveMint",
    "published_at": "2025-11-07T16:00:00"
  },
  {
    "id": "N24",
    "title": "Nifty Bank hits all-time high led by private lenders",
    "body": "Nifty Bank index hits an all-time high led by gains in private sector lenders. Further details were not immediately available.",
    "source": "MoneyControl",
    "published_at": "2025-11-08T16:30:00"
  },
  {
    "id": "N25",
    "title": "PSU banks outperform as asset quality improves",
    "body": "PSU banks outperform the broader market as asset quality improves and provisions decline. Further details were not immediately available.",
    "source": "Business Standard",
    "published_at": "2025-11-09T17:00:00"
  },
  {
    "id": "N26",
    "title": "HDFC Bank, ICICI Bank among top gainers in today's trade",
    "body": "HDFC Bank and ICICI Bank are among the top gainers in today's trade on strong buying interest. Further details were not immediately available.",
    "source": "Economic Times",
    "published_at": "2025-11-10T17:30:00"
  },
  {
    "id": "N27",
    "title": "RBI Governor hints at gradual withdrawal of accommodation",
    "body": "The RBI Governor hints at a gradual withdrawal of monetary accommodation in the coming quarters. Further details were not immediately available.",
    "source": "LiveMint",
    "published_at": "2025-11-01T18:00:00"
  },
  {
    "id": "N28",
    "title": "India's GDP grows 7.8% in Q1, led by services and manufacturing",
    "body": "India's GDP grows 7.8% in Q1, led by strong performance in services and manufacturing sectors. Further details were not immediately available.",
    "source": "MoneyControl",
    "published_at": "2025-11-02T18:30:00"
  },
  {
    "id": "N29",
    "title": "Mutual fund SIP inflows hit fresh record high",
    "body": "Mutual fund SIP inflows hit a fresh record high as retail investors continue systematic investments. Further details were not immediately available.",
    "source": "Business Standard",
    "published_at": "2025-11-03T19:00:00"
  },
  {
    "id": "N30",
    "title": "Gold prices trade flat ahead of US Fed decision",
    "body": "Gold prices trade flat in early trade ahead of the US Federal Reserve's policy decision. Further details were not immediately available.",
    "source": "Economic Times",
    "published_at": "2025-11-04T19:30:00"
  }
]
